[
  "obsidian-linter",
  "settings-search",
  "settings-profiles",
  "dataview",
  "obsidian-auto-link-title",
  "obsidian-minimal-settings",
  "obsidian-style-settings",
  "omnisearch",
  "obsidian-timestamper",
  "hotkey-helper",
  "cmdr",
  "mononote",
  "obsidian-attachment-name-formatting",
  "lapel",
  "recent-files-obsidian",
  "tag-wrangler",
  "quick-tagger",
  "share-my-plugin-list",
  "obsidian-regex-replace",
  "dataview-serializer",
  "random-numbers-generator"
]